export default {
  projections: {
    РезервуарE: {
      колвоТоп: {
        __caption__: 'Колво топ'
      },
      состояние: {
        __caption__: 'Состояние'
      },
      idР: {
        __caption__: 'Id Р'
      },
      остаток: {
        __caption__: 'Остаток',
        номер: {
          __caption__: 'Номер'
        },
        колво: {
          __caption__: 'Колво'
        }
      }
    },
    РезервуарL: {
      колвоТоп: {
        __caption__: 'Колво топ'
      },
      состояние: {
        __caption__: 'Состояние'
      },
      idР: {
        __caption__: 'Id Р'
      },
      остаток: {
        __caption__: 'Номер',
        номер: {
          __caption__: 'Номер'
        },
        колво: {
          __caption__: 'Колво'
        }
      }
    }
  },
  validations: {
    idР: {
      __caption__: 'Id Р'
    },
    колвоТоп: {
      __caption__: 'Колво топ'
    },
    состояние: {
      __caption__: 'Состояние'
    },
    остаток: {
      __caption__: 'Остаток'
    }
  }
};
