export default {
  projections: {
    ПокупкаE: {
      сумма: {
        __caption__: 'Сумма'
      },
      количество: {
        __caption__: 'Количество'
      },
      базаКлиента: {
        __caption__: 'БазаКлиента',
        логин: {
          __caption__: 'Логин'
        }
      },
      остаток: {
        __caption__: 'Остаток',
        колво: {
          __caption__: 'Колво'
        }
      },
      ценноваяСтела: {
        __caption__: 'ЦенноваяСтела',
        наименование: {
          __caption__: 'Наименование'
        },
        цена: {
          __caption__: 'Цена'
        }
      }
    },
    ПокупкаL: {
      сумма: {
        __caption__: 'Сумма'
      },
      количество: {
        __caption__: 'Количество'
      },
      базаКлиента: {
        __caption__: 'Логин',
        логин: {
          __caption__: 'Логин'
        }
      },
      остаток: {
        __caption__: 'Колво',
        колво: {
          __caption__: 'Колво'
        }
      },
      ценноваяСтела: {
        __caption__: 'Наименование',
        наименование: {
          __caption__: 'Наименование'
        },
        цена: {
          __caption__: 'Цена'
        }
      }
    }
  },
  validations: {
    количество: {
      __caption__: 'Количество'
    },
    сумма: {
      __caption__: 'Сумма'
    },
    базаКлиента: {
      __caption__: 'базаКлиента'
    },
    остаток: {
      __caption__: 'остаток'
    },
    ценноваяСтела: {
      __caption__: 'ценноваяСтела'
    },
    автоматизация: {
      __caption__: 'автоматизация'
    }
  }
};
